Show / Hide Table of Contents
Class SteelSetupCISC
Steel setup IBC class
Inheritance
System.Object
SteelSetup
SteelSetupCISC
Inherited Members
 SteelSetup.FrictionCoefficientPboltDefault()
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SteelSetupCISC : SteelSetup
Properties
Improve this Doc   View Source
Anchor_Fiar
Safety factor Anchor_Fiar
Declaration
public double Anchor_Fiar { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Bolt_Fib
Safety factor Bolt_Fib
Declaration
public double Bolt_Fib { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Structural_Fi
Safety factor Structural_Fi
Declaration
public double Structural_Fi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Weld_Fiw
Safety factor Weld_Fiw
Declaration
public double Weld_Fiw { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source